# ===================================================================================================================

# 대상 Origin 프로젝트 지정

# opj_path: 프로젝트가 있는 폴더 *** 끝의 백슬래시 제거해야함 ***
opj_path = r"C:\Users\woong\Desktop"

# opj_name: 확장자를 포함한 Origin 프로젝트 이름
opj_name = "KangSnyder.opju"


# ===================================================================================================================

# KangSnyder 워크시트 *** 변경 XXX ***
KangSnyder_wb_name = "KangSnyder"
func_ws_name = "func"

# ===================================================================================================================

# Fitting 데이터가 있는 Workbook 및 Worksheet 지정
# Workbook 이름의 경우 long name, short name 무관하지만 long name을 추천

###[1]### A열에 σ, B열에 S
###[2]### S의 단위는 μV/K
###[3]### B열의 comments에 데이터 라벨 넣기!! (예시: 고분자 이름)

data_wb_name = "Data"
data_ws_name = "Data"

# ===================================================================================================================

# F(η) 도출을 위한 η의 범위 지정

# eta의 범위 지정
start = -100.0
end = 100.0
interval = 0.1
eta_range = [start, end + 1e-8, interval]


# ===================================================================================================================

# Fitting할 범위 설정

# s=1일 때, σ_E0의 fitting 범위 (1 ~ 100 사이 안정화)
s_1_LB = 100                        # σ_E0 하한값
s_1_UB = 150                        # σ_E0 상한값
s_1_init = (s_1_LB + s_1_UB)/2      # σ_E0 초기값 [Grid search fit 알고리즘에는 필요하지 않음]

# s=3일 때, σ_E0의 fitting 범위 (0.1 ~ 2 사이 안정화)
s_3_LB = 0.3                        # σ_E0 하한값
s_3_UB = 0.8                        # σ_E0 상한값
s_3_init = (s_3_LB + s_3_UB)/2      # σ_E0 초기값 [Grid search fit 알고리즘에는 필요하지 않음]

# Fitting 코드에 넘겨줄 fitting 범위 및 초기값
fit_range = [[s_1_LB, s_1_UB], [s_3_LB, s_3_UB]]
sigma_E0_init = [s_1_init, s_3_init]

# ===================================================================================================================
# ===================================================================================================================