# dataAssign.py
# ===================================================================================================================
# 대상 Origin 프로젝트 지정

# opj_path: 프로젝트가 있는 폴더 *** 끝의 백슬래시 제거해야함 ***
opj_path = r"C:\Users\woong\Dropbox\==== SKKU-SAINT ====\==== SAINT-OSL ====\1. Research tmp\2025_Operando GIWAXS_Hanyang"

# opj_name: 확장자를 포함한 Origin 프로젝트 이름
opj_name = "GIWAXS request_260314_Hanyang Elvis.opju"

# ===================================================================================================================
# 피팅할 데이터가 들어있는 Workbook 이름
data_wb_name = "Elvis_123_qxy"

# ===================================================================================================================
# Fitting 모델 설정

# exponential background: a * x^(-b) + c  (MATLAB expBKG와 동일)
# Gaussian: amplitude * exp(-((x - mean)^2) / (2 * sigma^2))
#   여기서 sigma = FWHM / (2 * sqrt(2 * ln(2)))

# ===================================================================================================================
